InformationRegisters/ЖурналОшибок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.8">
	<InformationRegister>
		<Properties>
			<Name>ЖурналОшибок</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Описание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИмяМодуля</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяПроцедурыФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/ГлобальныйСерверПривилегированный/Ext/Module.bsl
Процедура ЗаписьВЖурналОшибок(ИмяМодуля, ИмяПроцедурыФункции, ОписаниеОшибки) Экспорт
	
	ОписаниеОшибки = ОписаниеОшибки + " ПользовательИД: " + Строка(ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор); 
	ДатаЗаписи = ТекущаяДата(); 
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
                  |	ЖурналОшибок.Описание
                  |ИЗ
                  |	РегистрСведений.ЖурналОшибок КАК ЖурналОшибок
                  |ГДЕ
                  |	ЖурналОшибок.Период = &Период
                  |	И ЖурналОшибок.ИмяМодуля = &ИмяМодуля
                  |	И ЖурналОшибок.ИмяПроцедурыФункции = &ИмяПроцедурыФункции";
				  
	Запрос.УстановитьПараметр("Период", ДатаЗаписи);
	Запрос.УстановитьПараметр("ИмяМодуля", ИмяМодуля);
	Запрос.УстановитьПараметр("ИмяПроцедурыФункции", ИмяПроцедурыФункции);
	Результат = Запрос.Выполнить();
	
	ЗаписьВЖурнал = РегистрыСведений.ЖурналОшибок.СоздатьМенеджерЗаписи();
	ЗаписьВЖурнал.Период = ДатаЗаписи;
	ЗаписьВЖурнал.ИмяМодуля = ИмяМодуля; 
	ЗаписьВЖурнал.ИмяПроцедурыФункции = ИмяПроцедурыФункции;
	Если Результат.Пустой() Тогда 	
		ЗаписьВЖурнал.Описание = ОписаниеОшибки;
	Иначе
		Выборка = Результат.Выбрать();
		Выборка.Следующий();
		ЗаписьВЖурнал.Описание = Выборка.Описание + Символы.ПС + "-------------------------" + Символы.ПС + ОписаниеОшибки;
    КонецЕсли;
	ЗаписьВЖурнал.Записать(Истина);
	
КонецПроцедуры
